window.onload = function (){
 
var lecture_room = {   //강의실 객체

    //갈멜관
    
    CalmelBhall : [['사회복지진로설계', 'SW237-G', '브니엘홀', ['수 15:30~16:20']], ['색으로마음읽기', 'GE955-A', '브니엘홀', ['월 16:20~17:35', '목 16:20~17:35']], ['성서적세계관의확립Ⅱ', 'GE734-A', '브니엘홀', ['수 09:00~10:15']], ['성서적세계관의확립Ⅱ', 'GE734-B', '브니엘홀', ['수 10:25~11:40']], ['소셜네트워크와집단지성', 'GE888-A', '브니엘홀', ['월 14:55~16:10', '목 14:55~16:10']], ['시사일본어', 'GE796-A', '브니엘홀', ['화 17:45~19:25']], ['신약Ⅰ', 'TH218-A', '브니엘홀', ['월 10:25~11:40', '목 10:25~11:40']], ['언어지도', 'CC069-A', '브니엘홀', ['화 09:00~10:15', '금 09:00~10:15']], ['영화로사회읽기', 'GE929-A', '브니엘홀', ['수 16:30~17:45', '수 17:55~19:10']], ['전도훈련Ⅱ', 'GE490-B', '브니엘홀', ['수 13:30~15:20']], ['전도훈련Ⅱ', 'GE490-I', '브니엘홀', ['수 13:30~15:20']], ['전도훈련Ⅳ', 'GE492-B', '브니엘홀', ['수 13:30~15:20']], ['전도훈련Ⅳ', 'GE492-I', '브니엘홀', ['수 13:30~15:20']], ['전도훈련Ⅵ', 'GE494-B', '브니엘홀', ['수 13:30~15:20']], ['전도훈련Ⅵ', 'GE494-I', '브니엘홀', ['수 13:30~15:20']], ['전도훈련Ⅷ', 'GE496-B', '브니엘홀', ['수 13:30~15:20']], ['전도훈련Ⅷ', 'GE496-I', '브니엘홀', ['수 13:30~15:20']], ['프레젠테이션의실제', 'GE956-A', '브니엘홀', ['월 13:30~14:45', '목 13:30~14:45']], ['한국현대문학', 'GE880-A', '브니엘홀', ['월 09:00~10:15', '목 09:00~10:15']]],

    CalmelInfo3 : [['멀티미디어제작', 'GE943-A', '교양정보3실', ['화 13:30~14:45', '금 13:30~14:45']], ['소프트웨어와창의적사고', 'GE777-A', '교양정보3실', ['월 13:30~14:45', '목 13:30~14:45']], ['소프트웨어코딩기초', 'GE800-A', '교양정보3실', ['월 14:55~16:10']], ['소프트웨어코딩기초', 'GE800-B', '교양정보3실', ['월 16:20~17:35']], ['소프트웨어코딩기초', 'GE800-C', '교양정보3실', ['목 09:00~10:15']], ['소프트웨어코딩기초', 'GE800-D', '교양정보3실', ['목 10:25~11:40']], ['소프트웨어코딩기초', 'GE800-E', '교양정보3실', ['금 09:00~10:15']], ['소프트웨어코딩기초', 'GE800-F', '교양정보3실', ['금 10:25~11:40']], ['진로세미나', 'TH204-F', '교양정보3실', ['수 15:30~16:20']]],
    
    CalmelInfo4 : [['진로세미나', 'TH204-H', '교양정보4실', ['수 15:30~16:20']]],

    Calmel301   : [['사회복지진로설계', 'SW237-A', '갈멜관 301호', ['수 15:30~16:20']], ['전도훈련Ⅱ', 'GE490-D', '갈멜관 301호', ['수 13:30~15:20']], ['전도훈련Ⅱ', 'GE490-V', '갈멜관 301호', ['수 13:30~15:20']], ['전도훈련Ⅳ', 'GE492-D', '갈멜관 301호', ['수 13:30~15:20']], ['전도훈련Ⅳ', 'GE492-V', '갈멜관 301호', ['수 13:30~15:20']], ['전도훈련Ⅵ', 'GE494-D', '갈멜관 301호', ['수 13:30~15:20']], ['전도훈련Ⅵ', 'GE494-V', '갈멜관 301호', ['수 13:30~15:20']], ['전도훈련Ⅷ', 'GE496-D', '갈멜관 301호', ['수 13:30~15:20']], ['전도훈련Ⅷ', 'GE496-V', '갈멜관 301호', ['수 13:30~15:20']]], 
    
    Calmel303   : [['사회복지진로설계', 'SW237-B', '갈멜관 303호', ['수 15:30~16:20']], ['전도훈련Ⅱ', 'GE490-1', '갈멜관 303호', ['수 13:30~15:20']], ['전도훈련Ⅱ', 'GE490-W', '갈멜관 303호', ['수 13:30~15:20']], ['전도훈련Ⅳ', 'GE492-1', '갈멜관 303호', ['수 13:30~15:20']], ['전도훈련Ⅳ', 'GE492-W', '갈멜관 303호', ['수 13:30~15:20']], ['전도훈련Ⅵ', 'GE494-1', '갈멜관 303호', ['수 13:30~15:20']], ['전도훈련Ⅵ', 'GE494-W', '갈멜관 303호', ['수 13:30~15:20']], ['전도훈련Ⅷ', 'GE496-1', '갈멜관 303호', ['수 13:30~15:20']], ['전도훈련Ⅷ', 'GE496-W', '갈멜관 303호', ['수 13:30~15:20']]],

    Calmel305   : [['간호과정과비판적사고', 'NU007-A', '갈멜관 305호', ['화 13:30~15:10']], ['공감하는인간의소통', 'GE876-A', '갈멜관 305호', ['월 10:25~11:40', '목 10:25~11:40']], ['바이블리딩Ⅱ', 'TH178-A', '갈멜관 305호', ['월 08:00~08:50', '화 08:00~08:50', '수 08:00~08:50', '목 08:00~08:50', '금 08:00~08:50']], ['사회봉사Ⅱ', 'GE505-A', '갈멜관 305호', ['금 17:45~19:45']], ['성서기반사회복지실천', 'SW292-A', '갈멜관 305호', ['월 13:30~14:45', '목 13:30~14:45']], ['성서적세계관의실천Ⅱ', 'GE736-A', '갈멜관 305호', ['수 09:00~10:15']], ['성서적세계관의실천Ⅱ', 'GE736-B', '갈멜관 305호', ['수 10:25~11:40']], ['영어Ⅱ', 'GE510-C', '갈멜관 305호', ['화 10:00~11:40']], ['영어Ⅱ', 'GE510-E', '갈멜관 305호', ['화 15:30~17:10']], ['의사소통론', 'NU071-A', '갈멜관 305호', ['화 17:30~19:10']], ['전도훈련Ⅱ', 'GE490-5', '갈멜관 305호', ['수 13:30~15:20']], ['전도훈련Ⅱ', 'GE490-P', '갈멜관 305호', ['수 13:30~15:20']], ['전도훈련Ⅳ', 'GE492-5', '갈멜관 305호', ['수 13:30~15:20']], ['전도훈련Ⅳ', 'GE492-P', '갈멜관 305호', ['수 13:30~15:20']], ['전도훈련Ⅵ', 'GE494-5', '갈멜관 305호', ['수 13:30~15:20']], ['전도훈련Ⅵ', 'GE494-P', '갈멜관 305호', ['수 13:30~15:20']], ['전도훈련Ⅷ', 'GE496-5', '갈멜관 305호', ['수 13:30~15:20']], ['전도훈련Ⅷ', 'GE496-P', '갈멜관 305호', ['수 13:30~15:20']], ['정신간호학Ⅰ', 'NU016-A', '갈멜관 305호', ['금 13:30~14:40', '금 14:50~16:00']], ['진로세미나', 'TH204-C', '갈멜관 305호', ['수 15:30~16:20']], ['한국근현대사', 'GE786-A', '갈멜관 305호', ['월 09:00~10:15', '목 09:00~10:15']], ['힐링과행복코칭', 'GE705-A', '갈멜관 305호', ['월 14:55~16:10', '목 14:55~16:10']], ['IT창업응용', 'IC183-A', '갈멜관 305호', ['월 16:20~17:35', '월 17:45~19:00']]],

    CalmelLab1  : [['미래설계상담', 'IC127-D', '컴소실습실1', ['수 15:30~16:20']], ['컴퓨터프로그래밍기초Ⅱ', 'IC142-A', '컴소실습실1', ['목 09:00~10:15', '금 13:30~14:45']], ['컴퓨터프로그래밍기초Ⅱ', 'IC142-B', '컴소실습실1', ['목 10:25~11:40', '금 14:55~16:10']]],

    CalmelLab2 : [['고급프로그래밍', 'IC187-A', '컴소실습실2', ['목 09:00~10:15', '목 10:25~11:40']], ['데이터베이스', 'IC067-A', '컴소실습실2', ['월 13:30~14:45', '화 13:30~14:45']], ['미래설계상담', 'IC127-C', '컴소실습실2', ['수 15:30~16:20']], ['자료구조', 'IC059-A', '컴소실습실2', ['월 14:55~16:10', '화 14:55~16:10']], ['정보보호개론', 'IC157-A', '컴소실습실2', ['월 09:00~10:15', '화 10:25~11:40']], ['컴퓨터구조', 'IC040-A', '컴소실습실2', ['월 10:25~11:40', '목 13:30~14:45']], ['컴퓨터네트워크설계', 'IC109-A', '컴소실습실2', ['화 09:00~10:15', '목 14:55~16:10']]] ,

    CalmelLab3 : [['네트워크프로그래밍', 'IC111-A', '컴소실습실3', ['월 10:25~11:40', '화 13:30~14:45']], ['데이터마이닝과통계', 'IC151-A', '컴소실습실3', ['월 09:00~10:15', '화 10:25~11:40']], ['미래설계상담', 'IC127-B', '컴소실습실3', ['수 15:30~16:20']], ['웹시스템개발Ⅱ', 'IC180-A', '컴소실습실3', ['목 16:20~17:35', '금 10:25~11:40']], ['웹시스템개발Ⅱ', 'IC180-B', '컴소실습실3', ['목 10:25~11:40', '금 09:00~10:15']], ['이미지딥러닝', 'IC182-A', '컴소실습실3', ['목 09:00~10:15', '금 13:30~14:45']], ['프로젝트관리론', 'IC156-A', '컴소실습실3', ['월 13:30~14:45', '화 09:00~10:15']]],
    
    CalmelLab4 : [['모바일프로그래밍', 'IC075-A', '컴소실습실4', ['목 13:30~14:45', '목 14:55~16:10']], ['미래설계상담', 'IC127-A', '컴소실습실4', ['수 15:30~16:20']], ['종합설계Ⅱ', 'IC145-A', '컴소실습실4', ['목 17:45~19:00', '목 19:10~20:25']]],

    Moria109 : [['진로세미나', 'TH204-E', '모리아관 109호', ['수 15:30~16:20']]],

    Moria212 : [['간호진로설계', 'NU058-B', '모리아관 212호', ['수 15:30~16:20']]],
  
    Moria301 : [['간호윤리', 'NU072-A', '모리아관 301호', ['금 10:30~11:20']], ['간호진로설계', 'NU058-G', '모리아관 301호', ['수 15:30~16:20']], ['기본간호학이론Ⅱ', 'NU078-A', '모리아관 301호', ['수 16:30~18:10']], ['다문화의이해', 'NU059-A', '모리아관 301호', ['목 15:30~17:10']], ['모아선택실습', 'NU090-B', '모리아관 301호', ['목 09:00~11:30']], ['모아선택실습', 'NU090-C', '모리아관 301호', ['목 09:00~11:30']], ['사회복지글쓰기', 'SW301-A', '모리아관 301호', ['월 09:00~10:15', '월 10:25~11:40']], ['성인간호학Ⅲ', 'NU023-A', '모리아관 301호', ['월 13:50~15:00', '월 15:10~16:20']], ['성인간호학Ⅳ', 'NU029-A', '모리아관 301호', ['화 09:00~10:10', '화 10:20~11:30']], ['성인간호학실습Ⅱ', 'NU083-B', '모리아관 301호', ['금 09:00~11:30']], ['아동간호학Ⅱ', 'NU017-A', '모리아관 301호', ['화 13:30~14:40', '화 14:50~16:00']], ['전도훈련Ⅱ', 'GE490-N', '모리아관 301호', ['수 13:30~15:20']], ['전도훈련Ⅱ', 'GE490-T', '모리아관 301호', ['수 13:30~15:20']], ['전도훈련Ⅳ', 'GE492-N', '모리아관 301호', ['수 13:30~15:20']], ['전도훈련Ⅳ', 'GE492-T', '모리아관 301호', ['수 13:30~15:20']], ['전도훈련Ⅵ', 'GE494-N', '모리아관 301호', ['수 13:30~15:20']], ['전도훈련Ⅵ', 'GE494-T', '모리아관 301호', ['수 13:30~15:20']], ['전도훈련Ⅷ', 'GE496-N', '모리아관 301호', ['수 13:30~15:20']], ['전도훈련Ⅷ', 'GE496-T', '모리아관 301호', ['수 13:30~15:20']], ['지역사회간호학Ⅰ', 'NU022-A', '모리아관 301호', ['수 09:00~10:10', '수 10:20~11:30']]],

    Moria305 : [['간호진로설계', 'NU058-F', '모리아관 305호', ['수 15:30~16:20']], ['전도훈련Ⅱ', 'GE490-8', '모리아관 305호', ['수 13:30~15:20']], ['전도훈련Ⅱ', 'GE646-A', '모리아관 305호', ['수 13:30~15:20']], ['전도훈련Ⅳ', 'GE492-8', '모리아관 305호', ['수 13:30~15:20']], ['전도훈련Ⅳ', 'GE648-A', '모리아관 305호', ['수 13:30~15:20']], ['전도훈련Ⅵ', 'GE494-8', '모리아관 305호', ['수 13:30~15:20']], ['전도훈련Ⅵ', 'GE650-A', '모리아관 305호', ['수 13:30~15:20']], ['전도훈련Ⅷ', 'GE496-8', '모리아관 305호', ['수 13:30~15:20']], ['전도훈련Ⅷ', 'GE652-A', '모리아관 305호', ['수 13:30~15:20']]],

    Moria308 : [['간호진로설계', 'NU058-C', '모리아관 308호', ['수 15:30~16:20']], ['전도훈련Ⅱ', 'GE490-6', '모리아관 308호', ['수 13:30~15:20']], ['전도훈련Ⅱ', 'GE490-S', '모리아관 308호', ['수 13:30~15:20']], ['전도훈련Ⅳ', 'GE492-6', '모리아관 308호', ['수 13:30~15:20']], ['전도훈련Ⅳ', 'GE492-S', '모리아관 308호', ['수 13:30~15:20']], ['전도훈련Ⅵ', 'GE494-6', '모리아관 308호', ['수 13:30~15:20']], ['전도훈련Ⅵ', 'GE494-S', '모리아관 308호', ['수 13:30~15:20']], ['전도훈련Ⅷ', 'GE496-6', '모리아관 308호', ['수 13:30~15:20']], ['전도훈련Ⅷ', 'GE496-S', '모리아관 308호', ['수 13:30~15:20']]],

    Moria310 : [['간호진로설계', 'NU058-D', '모리아관 310호', ['수 15:30~16:20']], ['공연예술의이해와감상', 'GE787-A', '모리아관 310호', ['월 13:30~14:45', '목 13:30~14:45']], ['교회음악의이론과실제', 'GE792-A', '모리아관 310호', ['월 10:25~11:40', '목 10:25~11:40']], ['성서적세계관의확립Ⅱ', 'GE734-C', '모리아관 310호', ['수 09:00~10:15']], ['성서적세계관의확립Ⅱ', 'GE734-D', '모리아관 310호', ['수 10:25~11:40']], ['영어Ⅱ', 'GE510-D', '모리아관 310호', ['금 10:00~11:40']], ['영어Ⅱ', 'GE510-F', '모리아관 310호', ['금 15:30~17:10']], ['음악이론과피아노실습', 'GE890-A', '모리아관 310호', ['월 14:55~16:10', '목 14:55~16:10']], ['전도훈련Ⅱ', 'GE490-U', '모리아관 310호', ['수 13:30~15:20']], ['전도훈련Ⅳ', 'GE492-U', '모리아관 310호', ['수 13:30~15:20']], ['전도훈련Ⅵ', 'GE494-U', '모리아관 310호', ['수 13:30~15:20']], ['전도훈련Ⅷ', 'GE496-U', '모리아관 310호', ['수 13:30~15:20']], ['현대사회와스포츠', 'GE675-A', '모리아관 310호', ['월 16:20~17:35', '월 17:45~19:00']]],


    //복음관
    Bokkeum301 : [['교회학교운영', 'TH228-A', '복음관 301호', ['월 16:20~17:35', '목 16:20~17:35']], ['구약Ⅱ', 'TH221-A', '복음관 301호', ['월 13:30~14:45', '목 13:30~14:45']], ['구약Ⅲ', 'TH239-A', '복음관 301호', ['월 10:25~11:40', '목 10:25~11:40']], ['바이블리딩Ⅱ', 'TH178-B', '복음관 301호', ['월 08:00~08:50', '화 08:00~08:50', '수 08:00~08:50', '목 08:00~08:50', '금 08:00~08:50']], ['성서적세계관의기초Ⅱ', 'GE732-A', '복음관 301호', ['수 09:00~10:15']], ['성서적세계관의기초Ⅱ', 'GE732-B', '복음관 301호', ['수 10:25~11:40']], ['성서해석학', 'TH054-A', '복음관 301호', ['월 14:55~16:10', '목 14:55~16:10']], ['신약개론', 'TH067-A', '복음관 301호', ['화 13:30~14:45', '금 13:30~14:45']], ['신약개론', 'TH067-B', '복음관 301호', ['화 14:55~16:10', '금 14:55~16:10']], ['전도훈련Ⅱ', 'GE490-A', '복음관 301호', ['수 13:30~15:20']], ['전도훈련Ⅱ', 'GE490-E', '복음관 301호', ['수 13:30~15:20']], ['전도훈련Ⅳ', 'GE492-A', '복음관 301호', ['수 13:30~15:20']], ['전도훈련Ⅳ', 'GE492-E', '복음관 301호', ['수 13:30~15:20']], ['전도훈련Ⅵ', 'GE494-A', '복음관 301호', ['수 13:30~15:20']], ['전도훈련Ⅵ', 'GE494-E', '복음관 301호', ['수 13:30~15:20']], ['전도훈련Ⅷ', 'GE496-A', '복음관 301호', ['수 13:30~15:20']], ['전도훈련Ⅷ', 'GE496-E', '복음관 301호', ['수 13:30~15:20']], ['정통과이단', 'TH164-A', '복음관 301호', ['월 09:00~10:15', '목 09:00~10:15']], ['진로세미나', 'TH204-D', '복음관 301호', ['수 15:30~16:20']]],
    
    Bokkeum303 : [['사회복지조사론', 'SW225-A', '복음관 303호', ['월 14:55~16:10', '목 14:55~16:10']], ['사회복지조사론', 'SW225-B', '복음관 303호', ['월 17:45~19:00', '목 17:45~19:00']], ['사회복지행정론', 'SW235-B', '복음관 303호', ['월 16:20~17:35', '목 16:20~17:35']], ['사회복지현장실습', 'SW208-A', '복음관 303호', ['목 09:00~10:15', '목 10:25~11:40']], ['전도훈련Ⅱ', 'GE490-3', '복음관 303호', ['수 13:30~15:20']], ['전도훈련Ⅱ', 'GE490-C', '복음관 303호', ['수 13:30~15:20']], ['전도훈련Ⅳ', 'GE492-3', '복음관 303호', ['수 13:30~15:20']], ['전도훈련Ⅳ', 'GE492-C', '복음관 303호', ['수 13:30~15:20']], ['전도훈련Ⅵ', 'GE494-3', '복음관 303호', ['수 13:30~15:20']], ['전도훈련Ⅵ', 'GE494-C', '복음관 303호', ['수 13:30~15:20']], ['전도훈련Ⅷ', 'GE496-3', '복음관 303호', ['수 13:30~15:20']], ['전도훈련Ⅷ', 'GE496-C', '복음관 303호', ['수 13:30~15:20']], ['지역사회보건', 'SW306-A', '복음관 303호', ['수 16:30~17:45', '수 17:55~19:10']], ['진로세미나', 'TH204-A', '복음관 303호', ['수 15:30~16:20']], ['특수목회사역', 'TH240-A', '복음관 303호', ['월 13:30~14:45', '목 13:30~14:45']]],
    
    Bokkeum401 : [['교회사', 'TH008-A', '복음관 401호', ['화 10:25~11:40', '금 10:25~11:40']], ['교회사', 'TH008-B', '복음관 401호', ['화 14:55~16:10', '금 14:55~16:10']], ['기독교레크리에이션', 'TH230-A', '복음관 401호', ['화 13:30~14:45', '금 13:30~14:45']], ['기독교윤리', 'TH027-A', '복음관 401호', ['월 09:00~10:15', '목 09:00~10:15']], ['상담의이론과실제', 'TH256-A', '복음관 401호', ['월 16:20~17:35', '목 16:20~17:35']], ['성경교수법', 'TH224-A', '복음관 401호', ['월 14:55~16:10', '목 14:55~16:10']], ['성서적세계관의실천Ⅱ', 'GE736-C', '복음관 401호', ['수 09:00~10:15']], ['성서적세계관의실천Ⅱ', 'GE736-D', '복음관 401호', ['수 10:25~11:40']], ['신약Ⅰ', 'TH218-B', '복음관 401호', ['월 13:30~14:45', '목 13:30~14:45']], ['영유아교육의진로탐색', 'CC113-F', '복음관 401호', ['수 15:30~16:20']], ['전도훈련Ⅱ', 'GE490-0', '복음관 401호', ['수 13:30~15:20']], ['전도훈련Ⅱ', 'GE490-X', '복음관 401호', ['수 13:30~15:20']], ['전도훈련Ⅳ', 'GE492-0', '복음관 401호', ['수 13:30~15:20']], ['전도훈련Ⅳ', 'GE492-X', '복음관 401호', ['수 13:30~15:20']], ['전도훈련Ⅵ', 'GE494-0', '복음관 401호', ['수 13:30~15:20']], ['전도훈련Ⅵ', 'GE494-X', '복음관 401호', ['수 13:30~15:20']], ['전도훈련Ⅷ', 'GE496-0', '복음관 401호', ['수 13:30~15:20']], ['전도훈련Ⅷ', 'GE496-X', '복음관 401호', ['수 13:30~15:20']], ['조직신학Ⅱ', 'TH200-A', '복음관 401호', ['월 10:25~11:40', '목 10:25~11:40']]],
    
    Bokkeum403 : [['사회복지진로설계', 'SW237-C', '복음관 403호', ['수 15:30~16:20']], ['예배와실제', 'TH241-A', '복음관 403호', ['월 14:55~16:10', '목 14:55~16:10']], ['전도훈련Ⅱ', 'GE490-R', '복음관 403호', ['수 13:30~15:20']], ['전도훈련Ⅱ', 'GE490-Z', '복음관 403호', ['수 13:30~15:20']], ['전도훈련Ⅳ', 'GE492-R', '복음관 403호', ['수 13:30~15:20']], ['전도훈련Ⅳ', 'GE492-Z', '복음관 403호', ['수 13:30~15:20']], ['전도훈련Ⅵ', 'GE494-R', '복음관 403호', ['수 13:30~15:20']], ['전도훈련Ⅵ', 'GE494-Z', '복음관 403호', ['수 13:30~15:20']], ['전도훈련Ⅷ', 'GE496-R', '복음관 403호', ['수 13:30~15:20']], ['전도훈련Ⅷ', 'GE496-Z', '복음관 403호', ['수 13:30~15:20']], ['조직신학Ⅱ', 'TH200-B', '복음관 403호', ['월 13:30~14:45', '목 13:30~14:45']], ['헬라어Ⅱ', 'TH227-A', '복음관 403호', ['월 16:20~17:35', '목 16:20~17:35']]],
    
    Bokkeum405 : [['사회복지진로설계', 'SW237-D', '복음관 405호', ['수 15:30~16:20']], ['전도훈련Ⅱ', 'GE490-H', '복음관 405호', ['수 13:30~15:20']], ['전도훈련Ⅱ', 'GE490-J', '복음관 405호', ['수 13:30~15:20']], ['전도훈련Ⅳ', 'GE492-H', '복음관 405호', ['수 13:30~15:20']], ['전도훈련Ⅳ', 'GE492-J', '복음관 405호', ['수 13:30~15:20']], ['전도훈련Ⅵ', 'GE494-H', '복음관 405호', ['수 13:30~15:20']], ['전도훈련Ⅵ', 'GE494-J', '복음관 405호', ['수 13:30~15:20']], ['전도훈련Ⅷ', 'GE496-H', '복음관 405호', ['수 13:30~15:20']], ['전도훈련Ⅷ', 'GE496-J', '복음관 405호', ['수 13:30~15:20']]],
    
    Bokkeum407 : [['사회복지현장실습', 'SW208-C', '복음관 407호', ['목 09:00~10:15', '목 10:25~11:40']], ['생활에필요한과학상식', 'GE921-A', '복음관 407호', ['화 16:20~17:35', '화 17:45~19:00']], ['성경읽기Ⅱ', 'GE920-A', '복음관 407호', ['월 08:00~08:50', '화 08:00~08:50', '수 08:00~08:50', '목 08:00~08:50', '금 08:00~08:50']], ['진로세미나', 'TH204-I', '복음관 407호', ['수 15:30~16:20']]],
    
    Bokkeum409 : [['진로세미나', 'TH204-K', '복음관 409호', ['수 15:30~16:20']]],


    //일립관
    
    
    IllipBasicSNLab1 : [['간호진로설계', 'NU058-E', '기본간호실습실', ['수 15:30~16:20']], ['기본간호학실습Ⅱ', 'NU079-B', '기본간호실습실', ['목 13:30~15:10']], ['기본간호학실습Ⅱ', 'NU079-C', '기본간호실습실', ['목 09:00~10:40']]], //기본간호실습실 1, 2
    
    IllipBasicSNLab2 : [['기본간호학실습Ⅱ', 'NU079-A', '기본간호실습실2', ['목 09:00~10:40']]],
    
    IllipEduLab : [['간호학개론', 'NU070-A', '보육실습실', ['목 17:30~19:10']], ['보육교사론', 'CC095-A', '보육실습실', ['화 09:00~10:15', '목 09:00~10:15']], ['아동동작', 'CC107-A', '보육실습실', ['월 14:55~16:10', '화 10:25~11:40']], ['아동동작', 'CC107-B', '보육실습실', ['월 16:20~17:35', '화 14:55~16:10']], ['아동상담론', 'CC125-A', '보육실습실', ['월 13:30~14:45', '목 14:55~16:10']], ['여성건강간호학Ⅱ', 'NU047-A', '보육실습실', ['월 09:00~10:10', '월 10:20~11:30']], ['영유아교육의진로탐색', 'CC113-A', '보육실습실', ['수 15:30~16:20']], ['전도훈련Ⅱ', 'GE490-K', '보육실습실', ['수 13:30~15:20']], ['전도훈련Ⅱ', 'GE490-Q', '보육실습실', ['수 13:30~15:20']], ['전도훈련Ⅳ', 'GE492-K', '보육실습실', ['수 13:30~15:20']], ['전도훈련Ⅳ', 'GE492-Q', '보육실습실', ['수 13:30~15:20']], ['전도훈련Ⅵ', 'GE494-K', '보육실습실', ['수 13:30~15:20']], ['전도훈련Ⅵ', 'GE494-Q', '보육실습실', ['수 13:30~15:20']], ['전도훈련Ⅷ', 'GE496-K', '보육실습실', ['수 13:30~15:20']], ['전도훈련Ⅷ', 'GE496-Q', '보육실습실', ['수 13:30~15:20']]], //보육실습실
    
    IllipBehavAnalysisLab : [['교육행정및교육경영', 'TE013-A', '수업행동분석실&amp;모의실습실', ['화 16:20~18:00']], ['아동미술', 'CC075-A', '수업행동분석실&amp;모의실습실', ['월 13:30~14:45', '월 14:55~16:10']], ['어린이집운영관리', 'CC127-A', '수업행동분석실&amp;모의실습실', ['월 09:00~10:15', '수 16:30~17:45']], ['영유아교육의진로탐색', 'CC113-E', '수업행동분석실&amp;모의실습실', ['수 15:30~16:20']], ['유아교과교재연구및지도법', 'CC103-A', '수업행동분석실&amp;모의실습실', ['금 10:25~11:40', '금 13:30~14:45']]], //수업행동분석실
    
    Illip405 : [['간호리더십', 'NU057-A', '일립관 405호', ['월 10:30~11:40']], ['노인간호학', 'NU026-A', '일립관 405호', ['수 10:30~11:40']], ['보건의료법', 'NU034-A', '일립관 405호', ['월 13:30~14:40', '목 13:30~14:40']], ['영적간호', 'NU043-A', '일립관 405호', ['금 09:00~10:10', '금 10:20~11:30']]],
    
    Illip501 : [['간호진로설계', 'NU058-A', '일립관 501호', ['수 15:30~16:20']], ['노인복지론', 'SW231-A', '일립관 501호', ['수 17:55~19:10', '수 19:20~20:35']], ['사회문제론', 'SW004-A', '일립관 501호', ['월 16:20~17:35', '목 16:20~17:35']], ['사회복지실천기술론', 'SW010-A', '일립관 501호', ['월 14:55~16:10', '목 14:55~16:10']], ['사회복지실천기술론', 'SW010-B', '일립관 501호', ['월 17:45~19:00', '목 17:45~19:00']], ['사회복지윤리와철학', 'SW012-A', '일립관 501호', ['월 09:00~10:15', '월 10:25~11:40']], ['사회복지행정론', 'SW235-A', '일립관 501호', ['월 13:30~14:45', '목 13:30~14:45']], ['사회복지현장실습', 'SW208-B', '일립관 501호', ['목 09:00~10:15', '목 10:25~11:40']], ['영어연습Ⅱ', 'GE727-A', '일립관 501호', ['금 10:00~11:40']], ['영어연습Ⅱ', 'GE727-B', '일립관 501호', ['금 13:30~15:10']], ['전도훈련Ⅱ', 'GE490-4', '일립관 501호', ['수 13:30~15:20']], ['전도훈련Ⅱ', 'GE490-O', '일립관 501호', ['수 13:30~15:20']], ['전도훈련Ⅳ', 'GE492-4', '일립관 501호', ['수 13:30~15:20']], ['전도훈련Ⅳ', 'GE492-O', '일립관 501호', ['수 13:30~15:20']], ['전도훈련Ⅵ', 'GE494-4', '일립관 501호', ['수 13:30~15:20']], ['전도훈련Ⅵ', 'GE494-O', '일립관 501호', ['수 13:30~15:20']], ['전도훈련Ⅷ', 'GE496-4', '일립관 501호', ['수 13:30~15:20']], ['전도훈련Ⅷ', 'GE496-O', '일립관 501호', ['수 13:30~15:20']]],
    
    Illip503 : [['사고와표현', 'GE936-A', '일립관 503호', ['화 10:00~11:40']], ['사고와표현', 'GE936-B', '일립관 503호', ['화 13:30~15:10']], ['사고와표현', 'GE936-C', '일립관 503호', ['화 15:30~17:10']], ['사고와표현', 'GE936-E', '일립관 503호', ['금 10:00~11:40']], ['사회복지법제와실천', 'SW289-A', '일립관 503호', ['월 13:30~14:45', '목 13:30~14:45']], ['사회복지법제와실천', 'SW289-B', '일립관 503호', ['월 14:55~16:10', '목 14:55~16:10']], ['사회복지세미나Ⅰ', 'SW259-A', '일립관 503호', ['수 16:30~17:45', '수 17:55~19:10']], ['사회복지세미나Ⅱ', 'SW260-A', '일립관 503호', ['목 16:20~17:35', '목 17:45~19:00']], ['아동간호학실습', 'NU086-C', '일립관 503호', ['금 16:10~18:40']], ['영유아교육의진로탐색', 'CC113-B', '일립관 503호', ['수 15:30~16:20']], ['인간행동과사회환경', 'SW037-A', '일립관 503호', ['월 09:00~10:15', '목 09:00~10:15']], ['인간행동과사회환경', 'SW037-B', '일립관 503호', ['월 10:25~11:40', '목 10:25~11:40']], ['전도훈련Ⅱ', 'GE490-7', '일립관 503호', ['수 13:30~15:20']], ['전도훈련Ⅱ', 'GE490-L', '일립관 503호', ['수 13:30~15:20']], ['전도훈련Ⅳ', 'GE492-7', '일립관 503호', ['수 13:30~15:20']], ['전도훈련Ⅳ', 'GE492-L', '일립관 503호', ['수 13:30~15:20']], ['전도훈련Ⅵ', 'GE494-7', '일립관 503호', ['수 13:30~15:20']], ['전도훈련Ⅵ', 'GE494-L', '일립관 503호', ['수 13:30~15:20']], ['전도훈련Ⅷ', 'GE496-7', '일립관 503호', ['수 13:30~15:20']], ['전도훈련Ⅷ', 'GE496-L', '일립관 503호', ['수 13:30~15:20']], ['커뮤니티케어의이해', 'SW300-A', '일립관 503호', ['월 16:20~17:35', '월 17:45~19:00']]],
    
    Illip505 : [['간호관리학실습', 'NU089-A', '일립관 505호', ['금 15:00~17:30']], ['간호관리학실습', 'NU089-B', '일립관 505호', ['금 15:00~17:30']], ['간호관리학실습', 'NU089-C', '일립관 505호', ['금 15:00~17:30']], ['간호세미나', 'NU015-A', '일립관 505호', ['월 16:30~17:40']], ['간호세미나', 'NU015-B', '일립관 505호', ['수 16:30~17:40']], ['기초간호과학Ⅰ', 'NU044-A', '일립관 505호', ['월 13:30~14:45', '수 16:30~17:45']], ['모아선택실습', 'NU090-A', '일립관 505호', ['목 09:00~11:30']], ['사회복지진로설계', 'SW237-E', '일립관 505호', ['수 15:30~16:20']], ['성인간호학실습Ⅱ', 'NU083-A', '일립관 505호', ['금 09:00~11:30']], ['성인간호학실습Ⅳ', 'NU085-A', '일립관 505호', ['목 16:00~18:30']], ['성인간호학실습Ⅳ', 'NU085-B', '일립관 505호', ['목 16:00~18:30']], ['성인간호학실습Ⅳ', 'NU085-C', '일립관 505호', ['목 16:00~18:30']], ['아동간호학실습', 'NU086-A', '일립관 505호', ['금 16:10~18:40']], ['약리학', 'NU073-A', '일립관 505호', ['화 10:00~11:40']], ['의료현장적응실습', 'NU082-A', '일립관 505호', ['월 09:00~11:30']], ['의료현장적응실습', 'NU082-B', '일립관 505호', ['월 13:30~16:00']], ['의료현장적응실습', 'NU082-C', '일립관 505호', ['월 16:10~18:40']], ['전도훈련Ⅱ', 'GE490-G', '일립관 505호', ['수 13:30~15:20']], ['전도훈련Ⅱ', 'GE646-C', '일립관 505호', ['수 13:30~15:20']], ['전도훈련Ⅳ', 'GE492-G', '일립관 505호', ['수 13:30~15:20']], ['전도훈련Ⅳ', 'GE648-C', '일립관 505호', ['수 13:30~15:20']], ['전도훈련Ⅵ', 'GE494-G', '일립관 505호', ['수 13:30~15:20']], ['전도훈련Ⅵ', 'GE650-C', '일립관 505호', ['수 13:30~15:20']], ['전도훈련Ⅷ', 'GE496-G', '일립관 505호', ['수 13:30~15:20']], ['전도훈련Ⅷ', 'GE652-C', '일립관 505호', ['수 13:30~15:20']], ['중환자관리', 'NU051-A', '일립관 505호', ['수 10:30~11:40']], ['지역사회간호학실습Ⅰ', 'NU087-A', '일립관 505호', ['목 13:30~16:00']], ['지역사회간호학실습Ⅰ', 'NU087-B', '일립관 505호', ['목 13:30~16:00']], ['지역사회간호학실습Ⅰ', 'NU087-C', '일립관 505호', ['목 13:30~16:00']]],
    
    Illip507 : [['교육과정및교육평가', 'TE002-A', '일립관 507호', ['수 16:30~18:10']], ['보육학개론', 'CC137-A', '일립관 507호', ['월 09:00~10:15', '목 09:00~10:15']], ['부모교육론', 'CC124-A', '일립관 507호', ['화 13:30~14:45', '목 14:55~16:10']], ['사회복지와문화다양성', 'SW288-A', '일립관 507호', ['월 13:30~14:45', '목 13:30~14:45']], ['성인간호학실습Ⅱ', 'NU083-C', '일립관 507호', ['금 09:00~11:30']], ['아동간호학실습', 'NU086-B', '일립관 507호', ['금 16:10~18:40']], ['영유아교육의진로탐색', 'CC113-C', '일립관 507호', ['수 15:30~16:20']], ['유아교육세미나', 'CC138-A', '일립관 507호', ['화 10:25~11:40', '수 09:00~10:15']], ['유아교육세미나', 'CC138-B', '일립관 507호', ['수 10:25~11:40', '목 13:30~14:45']], ['전도훈련Ⅱ', 'GE490-9', '일립관 507호', ['수 13:30~15:20']], ['전도훈련Ⅱ', 'GE490-Y', '일립관 507호', ['수 13:30~15:20']], ['전도훈련Ⅳ', 'GE492-9', '일립관 507호', ['수 13:30~15:20']], ['전도훈련Ⅳ', 'GE492-Y', '일립관 507호', ['수 13:30~15:20']], ['전도훈련Ⅵ', 'GE494-9', '일립관 507호', ['수 13:30~15:20']], ['전도훈련Ⅵ', 'GE494-Y', '일립관 507호', ['수 13:30~15:20']], ['전도훈련Ⅷ', 'GE496-9', '일립관 507호', ['수 13:30~15:20']], ['전도훈련Ⅷ', 'GE496-Y', '일립관 507호', ['수 13:30~15:20']], ['특수교육학개론', 'TE020-A', '일립관 507호', ['월 10:25~11:40', '목 10:25~11:40']], ['특수아상담및가족지원', 'CC112-A', '일립관 507호', ['화 14:55~16:10', '목 14:55~16:10']], ['학교현장실습', 'TE023-A', '일립관 507호', ['목 16:20~18:00']]],
    
    Illip509 : [['간호세미나', 'NU015-C', '일립관 509호', ['수 16:30~17:40']], ['교육봉사Ⅰ', 'TE026-A', '일립관 509호', ['금 09:00~10:40']], ['교육봉사Ⅱ', 'TE027-A', '일립관 509호', ['금 13:30~14:20']], ['사회보장론', 'SW006-A', '일립관 509호', ['월 17:45~19:00', '목 17:45~19:00']], ['생활지도및상담', 'TE024-A', '일립관 509호', ['월 10:25~11:40', '목 16:20~17:35']], ['영유아교수방법론', 'CC126-A', '일립관 509호', ['수 10:25~11:40', '목 09:00~10:15']], ['영유아교육의진로탐색', 'CC113-D', '일립관 509호', ['수 15:30~16:20']], ['장애아동보육론', 'CC142-A', '일립관 509호', ['월 13:30~14:45', '목 10:25~11:40']], ['전도훈련Ⅱ', 'GE490-F', '일립관 509호', ['수 13:30~15:20']], ['전도훈련Ⅱ', 'GE646-B', '일립관 509호', ['수 13:30~15:20']], ['전도훈련Ⅳ', 'GE492-F', '일립관 509호', ['수 13:30~15:20']], ['전도훈련Ⅳ', 'GE648-B', '일립관 509호', ['수 13:30~15:20']], ['전도훈련Ⅵ', 'GE494-F', '일립관 509호', ['수 13:30~15:20']], ['전도훈련Ⅵ', 'GE650-B', '일립관 509호', ['수 13:30~15:20']], ['전도훈련Ⅷ', 'GE496-F', '일립관 509호', ['수 13:30~15:20']], ['전도훈련Ⅷ', 'GE652-B', '일립관 509호', ['수 13:30~15:20']], ['정서및행동장애아교육', 'CC086-A', '일립관 509호', ['화 13:30~14:45', '목 13:30~14:45']], ['특수아진단및평가', 'CC108-A', '일립관 509호', ['월 09:00~10:15', '화 10:25~11:40']]],

    //밀알관
    
    MiralChall : [['건강증진과보건교육', 'NU009-A', '천마홀', ['화 15:30~17:10']], ['사회복지진로설계', 'SW237-F', '천마홀', ['수 15:30~16:20']], ['성격심리학', 'GE895-A', '천마홀', ['월 10:25~11:40', '목 10:25~11:40']], ['성서적세계관의기초Ⅱ', 'GE732-C', '천마홀', ['수 09:00~10:15']], ['성서적세계관의기초Ⅱ', 'GE732-D', '천마홀', ['수 10:25~11:40']], ['심리검사', 'GE757-A', '천마홀', ['월 13:30~14:45', '목 13:30~14:45']], ['영어Ⅱ', 'GE510-A', '천마홀', ['화 10:00~11:40']], ['영어Ⅱ', 'GE510-B', '천마홀', ['금 10:00~11:40']], ['전도훈련Ⅱ', 'GE490-2', '천마홀', ['수 13:30~15:20']], ['전도훈련Ⅱ', 'GE490-M', '천마홀', ['수 13:30~15:20']], ['전도훈련Ⅳ', 'GE492-2', '천마홀', ['수 13:30~15:20']], ['전도훈련Ⅳ', 'GE492-M', '천마홀', ['수 13:30~15:20']], ['전도훈련Ⅵ', 'GE494-2', '천마홀', ['수 13:30~15:20']], ['전도훈련Ⅵ', 'GE494-M', '천마홀', ['수 13:30~15:20']], ['전도훈련Ⅷ', 'GE496-2', '천마홀', ['수 13:30~15:20']], ['전도훈련Ⅷ', 'GE496-M', '천마홀', ['수 13:30~15:20']], ['청소년복지론', 'SW228-A', '천마홀', ['월 14:55~16:10', '목 14:55~16:10']], ['청소년상담', 'GE870-A', '천마홀', ['월 09:00~10:15', '목 09:00~10:15']], ['현대사회와물질주의', 'GE946-A', '천마홀', ['화 17:45~19:00', '금 17:45~19:00']]],

    MiralLogos : [['진로세미나', 'TH204-J', '로고스홀', ['수 15:30~16:20']]],
    
    
}
//시간 리스트를 교시 리스트로 전환

lecture_room.CalmelBhall = f_result(lecture_room.CalmelBhall);
lecture_room.CalmelInfo3 = f_result(lecture_room.CalmelInfo3);
lecture_room.CalmelInfo4 = f_result(lecture_room.CalmelInfo4); 
lecture_room.Calmel301 = f_result(lecture_room.Calmel301);
lecture_room.Calmel303 = f_result(lecture_room.Calmel303);
lecture_room.Calmel305 = f_result(lecture_room.Calmel305);
lecture_room.CalmelLab1 = f_result(lecture_room.CalmelLab1);
lecture_room.CalmelLab2 = f_result(lecture_room.CalmelLab2);
lecture_room.CalmelLab3 = f_result(lecture_room.CalmelLab3);
lecture_room.CalmelLab4 = f_result(lecture_room.CalmelLab4);
lecture_room.Moria109 = f_result(lecture_room.Moria109);
lecture_room.Moria212 = f_result(lecture_room.Moria212);
lecture_room.Moria301 = f_result(lecture_room.Moria301);
lecture_room.Moria305 = f_result(lecture_room.Moria305);
lecture_room.Moria308 = f_result(lecture_room.Moria308);
lecture_room.Moria310 = f_result(lecture_room.Moria310);
lecture_room.Bokkeum301 = f_result(lecture_room.Bokkeum301);
lecture_room.Bokkeum303 = f_result(lecture_room.Bokkeum303);
lecture_room.Bokkeum401 = f_result(lecture_room.Bokkeum401);
lecture_room.Bokkeum403 = f_result(lecture_room.Bokkeum403);
lecture_room.Bokkeum405 = f_result(lecture_room.Bokkeum405);
lecture_room.Bokkeum407 = f_result(lecture_room.Bokkeum407);
lecture_room.Bokkeum409 = f_result(lecture_room.Bokkeum409);
lecture_room.IllipBasicSNLab1 = f_result(lecture_room.IllipBasicSNLab1);
lecture_room.IllipBasicSNLab2 = f_result(lecture_room.IllipBasicSNLab2);
lecture_room.IllipEduLab = f_result(lecture_room.IllipEduLab);
lecture_room.IllipBehavAnalysisLab = f_result(lecture_room.IllipBehavAnalysisLab);
lecture_room.Illip405 = f_result(lecture_room.Illip405);
lecture_room.Illip501 = f_result(lecture_room.Illip501);
lecture_room.Illip503 = f_result(lecture_room.Illip503);
lecture_room.Illip505 = f_result(lecture_room.Illip505);
lecture_room.Illip507 = f_result(lecture_room.Illip507);
lecture_room.Illip509 = f_result(lecture_room.Illip509);
lecture_room.MiralChall = f_result(lecture_room.MiralChall);
lecture_room.MiralLogos = f_result(lecture_room.MiralLogos);



for (var i in Object.keys(lecture_room)){
    console.log(`현재 i의 값 : ${i}`); 
    console.log(`현재 key : ${Object.keys(lecture_room)[i]}`);
    console.log(`현재 value : ${lecture_room[Object.keys(lecture_room)[i]]}`);
    console.log("-------------------\n\n");
}



var keys_lecture_room = [];  
var values_lecture_room =[];   

keys_lecture_room =Object.keys(lecture_room); // 객체의 키값을 배열로 저장

// console.log(keys_lecture_room);
values_lecture_room =Object.values(lecture_room);  //객체의 벨류값을 배열로 저장 , but, 제대로 저장 안되고 있음 해결법 찾기

// console.log(values_lecture_room[3]);
// console.log(lecture_room.CalmelBhall);

// console.log(keys_lecture_room);

var v_startTime = new Date();
if(8>v_startTime.getHours() || 22 <= v_startTime.getHours()){
    v_nowGyosi = "Not";
}
else{
v_nowGyosi = f_gyosiM(v_startTime.getDay(), (v_startTime.getHours() * 100 + v_startTime.getMinutes()));
}



function f_result(v_Data){ //해당 데이터의 모든 교시값을 반환하는 함수
var Time= []; 
var div= [];
var result = [];

Array.prototype.insert = function ( index, item ) { this.splice( index, 0, item ); }; //insert 함수 정의

for(var i=0;i<v_Data.length;i++)   // 받은 데이터를 이중배열[강의하나][두개의 시간]
{

Time.insert(i,v_Data[i][3]);   //가져온 데이터값에서 인덱스[i][3]에 저장된 시간 정보만 time이라는 배열에 저장

}

div =String(Time).split(","); // 두개 묶인거 인덱스 하나 하나로 변환 

for(i=0; i<(Time.length)*2-1; i++){   //요일과 시간 분리
div[i]= String(div[i]).split(" ");
}



for(i=0; i<(Time.length)*2-1; i++){   //00:00~01:00 => 0100 끝나는시간만으로 변환
div[i][1] = String(div[i][1]).substr(6);    // ~까지 자르고
div[i][1] = String(div[i][1]).replace(':','');   //  ':' 제거 
}



for(i=0; i<(Time.length)*2-1; i++){    //요일을 숫자로
div[i][0] = div[i][0].replace('월','1');
div[i][0] = div[i][0].replace('화','2');
div[i][0] = div[i][0].replace('수','3');
div[i][0] = div[i][0].replace('목','4');
div[i][0] = div[i][0].replace('금','5');
} 

for(i=0; i<(Time.length)*2-1; i++){     //마지막 교시출력된 배열 결과
result[i]=f_gyosiM(div[i][0],div[i][1]);
} 

return result;
}  

function f_gyosiM(v_week, v_time) {   //요일과,시간을 넣으면 교시출력해주는 함수
var v_tmpGyosi = 0;
if (v_week == 0) {
} else if(v_week == 1 ){
    if (v_time <= 1015 && v_time >=800) { v_tmpGyosi = 11; }
    else if (v_time <= 1140 && v_time >= 1025) { v_tmpGyosi = 12; }
    else if (v_time <= 1445 && v_time >= 1330) { v_tmpGyosi = 13; }
    else if (v_time <= 1610 && v_time >= 1455) { v_tmpGyosi = 14; }
    else if (v_time <= 1735 && v_time >= 1620) { v_tmpGyosi = 15; }
    else if (v_time <= 1900 && v_time >= 1745) { v_tmpGyosi = 16; }
    else if (v_time <= 2025 && v_time >= 1910) { v_tmpGyosi = 17; }
    else if (v_time <= 2150 && v_time >= 2035) { v_tmpGyosi = 18; }
    else { v_tmpGyosi = "Null"; }
}else if(v_week == 2){
    if (v_time <= 1015 && v_time >=800) { v_tmpGyosi = 21; }
    else if (v_time <= 1140 && v_time >= 1025) { v_tmpGyosi = 22; }
    else if (v_time <= 1445 && v_time >= 1330) { v_tmpGyosi = 23; }
    else if (v_time <= 1610 && v_time >= 1455) { v_tmpGyosi = 24; }
    else if (v_time <= 1735 && v_time >= 1620) { v_tmpGyosi = 25; }
    else if (v_time <= 1900 && v_time >= 1745) { v_tmpGyosi = 26; }
    else if (v_time <= 2025 && v_time >= 1910) { v_tmpGyosi = 27; }
    else if (v_time <= 2150 && v_time >= 2035) { v_tmpGyosi = 28; }
    else { v_tmpGyosi = "Null"; }
}else if(v_week == 3){
    if (v_time <= 1015 && v_time >=800) { v_tmpGyosi = 31; }
    else if (v_time <= 1140 && v_time >= 1025) { v_tmpGyosi = 32; }
    else if (v_time <= 1445 && v_time >= 1330) { v_tmpGyosi = 33; }
    else if (v_time <= 1610 && v_time >= 1455) { v_tmpGyosi = 34; }
    else if (v_time <= 1735 && v_time >= 1620) { v_tmpGyosi = 35; }
    else if (v_time <= 1900 && v_time >= 1745) { v_tmpGyosi = 36; }
    else if (v_time <= 2025 && v_time >= 1910) { v_tmpGyosi = 37; }
    else if (v_time <= 2150 && v_time >= 2035) { v_tmpGyosi = 38; }
    else { v_tmpGyosi = "Null"; }
}else if(v_week == 4){
    if (v_time <= 1015 && v_time >=800) { v_tmpGyosi = 41; }
    else if (v_time <= 1140 && v_time >= 1025) { v_tmpGyosi = 42; }
    else if (v_time <= 1445 && v_time >= 1330) { v_tmpGyosi = 43; }
    else if (v_time <= 1610 && v_time >= 1455) { v_tmpGyosi = 44; }
    else if (v_time <= 1735 && v_time >= 1620) { v_tmpGyosi = 45; }
    else if (v_time <= 1900 && v_time >= 1745) { v_tmpGyosi = 46; }
    else if (v_time <= 2025 && v_time >= 1910) { v_tmpGyosi = 47; }
    else if (v_time <= 2150 && v_time >= 2035) { v_tmpGyosi = 48; }
    else { v_tmpGyosi = "Null"; }
}else if(v_week == 5){
    if (v_time <= 1015 && v_time >=800) { v_tmpGyosi = 51; }
    else if (v_time <= 1140 && v_time >= 1025) { v_tmpGyosi = 52; }
    else if (v_time <= 1445 && v_time >= 1330) { v_tmpGyosi = 53; }
    else if (v_time <= 1610 && v_time >= 1455) { v_tmpGyosi = 54; }
    else if (v_time <= 1735 && v_time >= 1620) { v_tmpGyosi = 55; }
    else if (v_time <= 1900 && v_time >= 1745) { v_tmpGyosi = 56; }
    else if (v_time <= 2025 && v_time >= 1910) { v_tmpGyosi = 57; }
    else if (v_time <= 2150 && v_time >= 2035) { v_tmpGyosi = 58; }
    else { v_tmpGyosi = "Null"; }
}

return v_tmpGyosi; //10자리 숫자 요일 , 1의 자리 숫자 교시 
}


// console.log(keys_lecture_room[4]);
//if문 13을 v_nowGyosi 로 바꿀것 .
// 현재시간을 실시간으로 가져오는게 아니어서 생기는 문제일듯.
// 자바스크립트가 실시간으로 계속 돌아야함.
for(i=0; i< lecture_room.CalmelBhall.length; i++){
    if( v_nowGyosi == lecture_room.CalmelBhall[i]){ 
        document.getElementsByClassName(keys_lecture_room[0])[0].style.backgroundColor = "#F58677";
        console.log(lecture_room.CalmelBhall[i]);
    }
    
}
for(i=0; i< lecture_room.CalmelInfo3.length; i++){
    if( v_nowGyosi == lecture_room.CalmelInfo3[i]){ 
        document.getElementsByClassName(keys_lecture_room[1])[0].style.backgroundColor = "#F58677";
        
    }
    
}
for(i=0; i< lecture_room.CalmelInfo4.length; i++){
    if( v_nowGyosi == lecture_room.CalmelInfo4[i]){ 
        document.getElementsByClassName(keys_lecture_room[2])[0].style.backgroundColor = "#F58677";
        
    }
    
}

for(i=0; i< lecture_room.Calmel301.length; i++){
    if( v_nowGyosi == lecture_room.Calmel301[i]){ 
        document.getElementsByClassName(keys_lecture_room[3])[0].style.backgroundColor = "#F58677";
        
    }
    
}

for(i=0; i< lecture_room.Calmel303.length; i++){
    if( v_nowGyosi == lecture_room.Calmel303[i]){ 
        document.getElementsByClassName(keys_lecture_room[4])[0].style.backgroundColor = "#F58677";
        
    }
    
}

for(i=0; i< lecture_room.Calmel305.length; i++){
    if( v_nowGyosi == lecture_room.Calmel305[i]){ 
        document.getElementsByClassName(keys_lecture_room[5])[0].style.backgroundColor = "#F58677";
        
    }
    
}

for(i=0; i< lecture_room.CalmelLab1.length; i++){
    if( v_nowGyosi == lecture_room.CalmelLab1[i]){ 
        document.getElementsByClassName(keys_lecture_room[6])[0].style.backgroundColor = "#F58677";
        
    }
    
}

for(i=0; i< lecture_room.CalmelLab2.length; i++){
    if( v_nowGyosi == lecture_room.CalmelLab2[i]){ 
        document.getElementsByClassName(keys_lecture_room[7])[0].style.backgroundColor = "#F58677";
        
    }
    
}

for(i=0; i< lecture_room.CalmelLab3.length; i++){
    if( v_nowGyosi == lecture_room.CalmelLab3[i]){ 
        document.getElementsByClassName(keys_lecture_room[8])[0].style.backgroundColor = "#F58677";
        
    }
    
}

for(i=0; i< lecture_room.CalmelLab4.length; i++){
    if( v_nowGyosi == lecture_room.CalmelLab4[i]){ 
        document.getElementsByClassName(keys_lecture_room[9])[0].style.backgroundColor = "#F58677";
        
    }
    
}
// 모리아관 ====================================================================================
for(i=0; i< lecture_room.Moria109.length; i++){
    if( v_nowGyosi == lecture_room.Moria109[i]){ 
        document.getElementsByClassName(keys_lecture_room[10])[0].style.backgroundColor = "#F58677";
        
    }
    
}

for(i=0; i< lecture_room.Moria212.length; i++){
    if( v_nowGyosi == lecture_room.Moria212[i]){ 
        document.getElementsByClassName(keys_lecture_room[11])[0].style.backgroundColor = "#F58677";
        
    }
    
}

for(i=0; i< lecture_room.Moria301.length; i++){
    if( v_nowGyosi == lecture_room.Moria301[i]){ 
        document.getElementsByClassName(keys_lecture_room[12])[0].style.backgroundColor = "#F58677";
        
    }
    
}

for(i=0; i< lecture_room.Moria305.length; i++){
    if( v_nowGyosi == lecture_room.Moria305[i]){ 
        document.getElementsByClassName(keys_lecture_room[13])[0].style.backgroundColor = "#F58677";
        
    }
    
}

for(i=0; i< lecture_room.Moria308.length; i++){
    if( v_nowGyosi == lecture_room.Moria308[i]){ 
        document.getElementsByClassName(keys_lecture_room[14])[0].style.backgroundColor = "#F58677";
        
    }
    
}

for(i=0; i< lecture_room.Moria310.length; i++){
    if( v_nowGyosi == lecture_room.Moria310[i]){ 
        document.getElementsByClassName(keys_lecture_room[15])[0].style.backgroundColor = "#F58677";
        
    }
    
}

for(i=0; i< lecture_room.Bokkeum301.length; i++){
    if( v_nowGyosi == lecture_room.Bokkeum301[i]){ 
        document.getElementsByClassName(keys_lecture_room[16])[0].style.backgroundColor = "#F58677";
        
    }
    
}

for(i=0; i< lecture_room.Bokkeum303.length; i++){
    if( v_nowGyosi == lecture_room.Bokkeum303[i]){ 
        document.getElementsByClassName(keys_lecture_room[17])[0].style.backgroundColor = "#F58677";
        
    }
    
}

for(i=0; i< lecture_room.Bokkeum401.length; i++){
    if( v_nowGyosi == lecture_room.Bokkeum401[i]){ 
        document.getElementsByClassName(keys_lecture_room[18])[0].style.backgroundColor = "#F58677";
        
    }
    
}

for(i=0; i< lecture_room.Bokkeum403.length; i++){
    if( v_nowGyosi == lecture_room.Bokkeum403[i]){ 
        document.getElementsByClassName(keys_lecture_room[19])[0].style.backgroundColor = "#F58677";
        
    }
    
}

for(i=0; i< lecture_room.Bokkeum405.length; i++){
    if( v_nowGyosi == lecture_room.Bokkeum405[i]){ 
        document.getElementsByClassName(keys_lecture_room[20])[0].style.backgroundColor = "#F58677";
        
    }
    
}

for(i=0; i< lecture_room.Bokkeum407.length; i++){
    if( v_nowGyosi == lecture_room.Bokkeum407[i]){ 
        document.getElementsByClassName(keys_lecture_room[21])[0].style.backgroundColor = "#F58677";
        
    }
    
}

for(i=0; i< lecture_room.Bokkeum409.length; i++){
    if( v_nowGyosi == lecture_room.Bokkeum409[i]){ 
        document.getElementsByClassName(keys_lecture_room[22])[0].style.backgroundColor = "#F58677";
        
    }
    
}
// 일립관 ====================================================================================
for(i=0; i< lecture_room.IllipBasicSNLab1.length; i++){
    if( v_nowGyosi == lecture_room.IllipBasicSNLab1[i]){ 
        document.getElementsByClassName(keys_lecture_room[23])[0].style.backgroundColor = "#F58677";
        
    }
    
}

for(i=0; i< lecture_room.IllipBasicSNLab2.length; i++){
    if( v_nowGyosi == lecture_room.IllipBasicSNLab2[i]){ 
        document.getElementsByClassName(keys_lecture_room[24])[0].style.backgroundColor = "#F58677";
        
    }
    
}

for(i=0; i< lecture_room.IllipEduLab.length; i++){
    if( v_nowGyosi == lecture_room.IllipEduLab[i]){ 
        document.getElementsByClassName(keys_lecture_room[25])[0].style.backgroundColor = "#F58677";
        
    }
    
}

for(i=0; i< lecture_room.IllipBehavAnalysisLab.length; i++){
    if( v_nowGyosi == lecture_room.IllipBehavAnalysisLab[i]){ 
        document.getElementsByClassName(keys_lecture_room[26])[0].style.backgroundColor = "#F58677";
        
    }
    
}

for(i=0; i< lecture_room.Illip405.length; i++){
    if( v_nowGyosi == lecture_room.Illip405[i]){ 
        document.getElementsByClassName(keys_lecture_room[27])[0].style.backgroundColor = "#F58677";
        
    }
    
}

for(i=0; i< lecture_room.Illip501.length; i++){
    if( v_nowGyosi == lecture_room.Illip501[i]){ 
        document.getElementsByClassName(keys_lecture_room[28])[0].style.backgroundColor = "#F58677";
        
    }
    
}

for(i=0; i< lecture_room.Illip503.length; i++){
    if( v_nowGyosi == lecture_room.Illip503[i]){ 
        document.getElementsByClassName(keys_lecture_room[29])[0].style.backgroundColor = "#F58677";
        
    }
    
}

for(i=0; i< lecture_room.Illip505.length; i++){
    if( v_nowGyosi == lecture_room.Illip505[i]){ 
        document.getElementsByClassName(keys_lecture_room[30])[0].style.backgroundColor = "#F58677";
        
    }
    
}

for(i=0; i< lecture_room.Illip507.length; i++){
    if( v_nowGyosi == lecture_room.Illip507[i]){ 
        document.getElementsByClassName(keys_lecture_room[31])[0].style.backgroundColor = "#F58677";
        
    }
    
}

for(i=0; i< lecture_room.Illip509.length; i++){
    if( v_nowGyosi == lecture_room.Illip509[i]){ 
        document.getElementsByClassName(keys_lecture_room[32])[0].style.backgroundColor = "#F58677";
        
    }
    
}
// 밀알관 ====================================================================================
for(i=0; i< lecture_room.MiralChall.length; i++){
    if( v_nowGyosi == lecture_room.MiralChall[i]){ 
        document.getElementsByClassName(keys_lecture_room[33])[0].style.backgroundColor = "#F58677";
        
    }
    
}

for(i=0; i< lecture_room.MiralLogos.length; i++){
    if( v_nowGyosi == lecture_room.MiralLogos[i]){ 
        document.getElementsByClassName(keys_lecture_room[34])[0].style.backgroundColor = "#F58677";
        
    }
    
}
// 시간표 모리아관 301호
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 11 == lecture_room.Moria301[i]){ 
        Moria301_11.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 12 == lecture_room.Moria301[i]){ 
        Moria301_12.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 13 == lecture_room.Moria301[i]){ 
        Moria301_13.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 14 == lecture_room.Moria301[i]){ 
        Moria301_14.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 15 == lecture_room.Moria301[i]){ 
        Moria301_15.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 16 == lecture_room.Moria301[i]){ 
        Moria301_16.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 17 == lecture_room.Moria301[i]){ 
        Moria301_17.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 18 == lecture_room.Moria301[i]){ 
        Moria301_18.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 21 == lecture_room.Moria301[i]){ 
        Moria301_21.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 22 == lecture_room.Moria301[i]){ 
        Moria301_22.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 23 == lecture_room.Moria301[i]){ 
        Moria301_23.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 24 == lecture_room.Moria301[i]){ 
        Moria301_24.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 25 == lecture_room.Moria301[i]){ 
        Moria301_25.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 26 == lecture_room.Moria301[i]){ 
        Moria301_26.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 27 == lecture_room.Moria301[i]){ 
        Moria301_27.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 28 == lecture_room.Moria301[i]){ 
        Moria301_28.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 31 == lecture_room.Moria301[i]){ 
        Moria301_21.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 32 == lecture_room.Moria301[i]){ 
        Moria301_32.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 33 == lecture_room.Moria301[i]){ 
        Moria301_33.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 34 == lecture_room.Moria301[i]){ 
        Moria301_34.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 35 == lecture_room.Moria301[i]){ 
        Moria301_35.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 36 == lecture_room.Moria301[i]){ 
        Moria301_36.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 37 == lecture_room.Moria301[i]){ 
        Moria301_37.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 38 == lecture_room.Moria301[i]){ 
        Moria301_38.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 41 == lecture_room.Moria301[i]){ 
        Moria301_41.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 42 == lecture_room.Moria301[i]){ 
        Moria301_42.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 43 == lecture_room.Moria301[i]){ 
        Moria301_43.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 44 == lecture_room.Moria301[i]){ 
        Moria301_44.style.backgroundColor = "orange";
        
    }  
}

for(i=0; i< lecture_room.Moria301.length; i++){
    if( 45 == lecture_room.Moria301[i]){ 
        Moria301_45[0].style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 46 == lecture_room.Moria301[i]){ 
        Moria301_46.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 47 == lecture_room.Moria301[i]){ 
        Moria301_47.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 48 == lecture_room.Moria301[i]){ 
        Moria301_48.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 51 == lecture_room.Moria301[i]){ 
        Moria301_51.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 52 == lecture_room.Moria301[i]){ 
        Moria301_52.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 53 == lecture_room.Moria301[i]){ 
        Moria301_53.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 54 == lecture_room.Moria301[i]){ 
        Moria301_54.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 55 == lecture_room.Moria301[i]){ 
        Moria301_55.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 56 == lecture_room.Moria301[i]){ 
        Moria301_56.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 57 == lecture_room.Moria301[i]){ 
        Moria301_57.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 58 == lecture_room.Moria301[i]){ 
        Moria301_58.style.backgroundColor = "orange";
        
    }  
}

// 시간표 모리아관 109호
for(i=0; i< lecture_room.Moria109.length; i++){
    if( 11 == lecture_room.Moria109[i]){ 
        Moria109_11.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 12 == lecture_room.Moria301[i]){ 
        Moria109_12.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 13 == lecture_room.Moria301[i]){ 
        Moria109_13.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 14 == lecture_room.Moria301[i]){ 
        Moria109_14.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 15 == lecture_room.Moria301[i]){ 
        Moria109_15.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 16 == lecture_room.Moria301[i]){ 
        Moria109_16.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 17 == lecture_room.Moria301[i]){ 
        Moria109_17.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 18 == lecture_room.Moria301[i]){ 
        Moria109_18.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 21 == lecture_room.Moria301[i]){ 
        Moria109_21.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 22 == lecture_room.Moria301[i]){ 
        Moria109_22.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 23 == lecture_room.Moria301[i]){ 
        Moria109_23.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 24 == lecture_room.Moria301[i]){ 
        Moria109_24.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 25 == lecture_room.Moria301[i]){ 
        Moria109_25.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 26 == lecture_room.Moria301[i]){ 
        Moria109_26.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 27 == lecture_room.Moria301[i]){ 
        Moria109_27.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 28 == lecture_room.Moria301[i]){ 
        Moria109_28.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 31 == lecture_room.Moria301[i]){ 
        Moria109_21.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 32 == lecture_room.Moria301[i]){ 
        Moria109_32.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 33 == lecture_room.Moria301[i]){ 
        Moria109_33.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 34 == lecture_room.Moria301[i]){ 
        Moria109_34.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 35 == lecture_room.Moria301[i]){ 
        Moria109_35.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 36 == lecture_room.Moria301[i]){ 
        Moria109_36.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 37 == lecture_room.Moria301[i]){ 
        Moria109_37.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 38 == lecture_room.Moria301[i]){ 
        Moria109_38.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 41 == lecture_room.Moria301[i]){ 
        Moria109_41.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 42 == lecture_room.Moria301[i]){ 
        Moria109_42.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 43 == lecture_room.Moria301[i]){ 
        Moria109_43.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 44 == lecture_room.Moria301[i]){ 
        Moria109_44.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 45 == lecture_room.Moria301[i]){ 
        Moria109_45[0].style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 46 == lecture_room.Moria301[i]){ 
        Moria109_46.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 47 == lecture_room.Moria301[i]){ 
        Moria109_47.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 48 == lecture_room.Moria301[i]){ 
        Moria109_48.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 51 == lecture_room.Moria301[i]){ 
        Moria109_51.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 52 == lecture_room.Moria301[i]){ 
        Moria109_52.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 53 == lecture_room.Moria301[i]){ 
        Moria109_53.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 54 == lecture_room.Moria301[i]){ 
        Moria109_54.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 55 == lecture_room.Moria301[i]){ 
        Moria109_55.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 56 == lecture_room.Moria301[i]){ 
        Moria109_56.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 57 == lecture_room.Moria301[i]){ 
        Moria109_57.style.backgroundColor = "orange";
        
    }  
}
for(i=0; i< lecture_room.Moria301.length; i++){
    if( 58 == lecture_room.Moria301[i]){ 
        Moria109_58.style.backgroundColor = "orange";
        
    }  
}

//CalmelBhall
for(i=0; i< lecture_room.CalmelBhall.length; i++){
    if( 12 == lecture_room.CalmelBhall[i]){ 
        CalmelBhall_12.style.backgroundColor = "orange";
    }  
}
for(i=0; i< lecture_room.CalmelBhall.length; i++){
    if( 14 == lecture_room.CalmelBhall[i]){ 
        CalmelBhall_14.style.backgroundColor = "orange";
    }  
}
for(i=0; i< lecture_room.CalmelBhall.length; i++){
    if( 15 == lecture_room.CalmelBhall[i]){ 
        CalmelBhall_15.style.backgroundColor = "orange";
    }  
}
for(i=0; i< lecture_room.CalmelBhall.length; i++){
    if( 21 == lecture_room.CalmelBhall[i]){ 
        CalmelBhall_21.style.backgroundColor = "orange";
    }  
}
for(i=0; i< lecture_room.CalmelBhall.length; i++){
    if( 27 == lecture_room.CalmelBhall[i]){ 
        CalmelBhall_27.style.backgroundColor = "orange";
    }  
}
for(i=0; i< lecture_room.CalmelBhall.length; i++){
    if( 31 == lecture_room.CalmelBhall[i]){ 
        CalmelBhall_31.style.backgroundColor = "orange";
    }  
}
for(i=0; i< lecture_room.CalmelBhall.length; i++){
    if( 32 == lecture_room.CalmelBhall[i]){ 
        CalmelBhall_32.style.backgroundColor = "orange";
    }  
}
for(i=0; i< lecture_room.CalmelBhall.length; i++){
    if( 34 == lecture_room.CalmelBhall[i]){ 
        CalmelBhall_34.style.backgroundColor = "orange";
    }  
}
for(i=0; i< lecture_room.CalmelBhall.length; i++){
    if( 35 == lecture_room.CalmelBhall[i]){ 
        CalmelBhall_35.style.backgroundColor = "orange";
    }  
}
for(i=0; i< lecture_room.CalmelBhall.length; i++){
    if( 36 == lecture_room.CalmelBhall[i]){ 
        CalmelBhall_36.style.backgroundColor = "orange";
    }  
}
for(i=0; i< lecture_room.CalmelBhall.length; i++){
    if( 37 == lecture_room.CalmelBhall[i]){ 
        CalmelBhall_37.style.backgroundColor = "orange";
    }  
}
for(i=0; i< lecture_room.CalmelBhall.length; i++){
    if( 44 == lecture_room.CalmelBhall[i]){ 
        CalmelBhall_44.style.backgroundColor = "orange";
    }  
}
for(i=0; i< lecture_room.CalmelBhall.length; i++){
    if( 45 == lecture_room.CalmelBhall[i]){ 
        CalmelBhall_45[0].style.backgroundColor = "orange";
    }  
}
for(i=0; i< lecture_room.CalmelBhall.length; i++){
    if( 42 == lecture_room.CalmelBhall[i]){ 
        CalmelBhall_42.style.backgroundColor = "orange";
    }  
}
for(i=0; i< lecture_room.CalmelBhall.length; i++){
    if( 51 == lecture_room.CalmelBhall[i]){ 
        CalmelBhall_51.style.backgroundColor = "orange";
    }  
}

//CalmelInfo3
for(i=0; i< lecture_room.CalmelInfo3.length; i++){
    if( 13 == lecture_room.CalmelInfo3[i]){ 
        CalmelInfo3_13.style.backgroundColor = "orange";
    }  
}
for(i=0; i< lecture_room.CalmelInfo3.length; i++){
    if( 15 == lecture_room.CalmelInfo3[i]){ 
        CalmelInfo3_15.style.backgroundColor = "orange";
    }  
}
for(i=0; i< lecture_room.CalmelInfo3.length; i++){
    if( 23 == lecture_room.CalmelInfo3[i]){ 
        CalmelInfo3_23.style.backgroundColor = "orange";
    }  
}
for(i=0; i< lecture_room.CalmelInfo3.length; i++){
    if( 41 == lecture_room.CalmelInfo3[i]){ 
        CalmelInfo3_41.style.backgroundColor = "orange";
    }  
}
for(i=0; i< lecture_room.CalmelInfo3.length; i++){
    if( 42 == lecture_room.CalmelInfo3[i]){ 
        CalmelInfo3_42.style.backgroundColor = "orange";
    }  
}
for(i=0; i< lecture_room.CalmelInfo3.length; i++){
    if( 43 == lecture_room.CalmelInfo3[i]){ 
        CalmelInfo3_43.style.backgroundColor = "orange";
    }  
}
for(i=0; i< lecture_room.CalmelInfo3.length; i++){
    if( 51 == lecture_room.CalmelInfo3[i]){ 
        CalmelInfo3_51.style.backgroundColor = "orange";
    }  
}
for(i=0; i< lecture_room.CalmelInfo3.length; i++){
    if( 52 == lecture_room.CalmelInfo3[i]){ 
        CalmelInfo3_52.style.backgroundColor = "orange";
    }  
}
for(i=0; i< lecture_room.CalmelInfo3.length; i++){
    if( 53 == lecture_room.CalmelInfo3[i]){ 
        CalmelInfo3_53.style.backgroundColor = "orange";
    }  
}

// CalmelInfo4
for(i=0; i< lecture_room.CalmelInfo4.length; i++){
    if( 35 == lecture_room.CalmelInfo4[i]){ 
        CalmelInfo4_35.style.backgroundColor = "orange";
    }  
}

// Calmel301
for(i=0; i< lecture_room.Calmel301.length; i++){
    if( 34 == lecture_room.Calmel301[i]){ 
        Calmel301_34.style.backgroundColor = "orange";
    }  
}
for(i=0; i< lecture_room.Calmel301.length; i++){
    if( 35 == lecture_room.Calmel301[i]){ 
        Calmel301_35.style.backgroundColor = "orange";
    }  
}

for(i=0; i< lecture_room.Calmel303.length; i++){
    if( 34 == lecture_room.Calmel303[i]){ 
        Calmel303_34.style.backgroundColor = "orange";
    }  
}
for(i=0; i< lecture_room.Calmel303.length; i++){
    if( 35 == lecture_room.Calmel303[i]){ 
        Calmel303_35.style.backgroundColor = "orange";
    }  
}

for(i=0; i< lecture_room.Calmel305.length; i++){
    if( 11 == lecture_room.Calmel305[i]){ 
        Calmel305_11.style.backgroundColor = "orange";
        Calmel305_21.style.backgroundColor = "orange";
        Calmel305_13.style.backgroundColor = "orange";
        Calmel305_12.style.backgroundColor = "orange";
        Calmel305_22.style.backgroundColor = "orange";
        Calmel305_24.style.backgroundColor = "orange";
        Calmel305_25.style.backgroundColor = "orange";
        Calmel305_27.style.backgroundColor = "orange";
        Calmel305_31.style.backgroundColor = "orange";
        Calmel305_32.style.backgroundColor = "orange";
        Calmel305_34.style.backgroundColor = "orange";
        Calmel305_41.style.backgroundColor = "orange";
        Calmel305_42.style.backgroundColor = "orange";
        Calmel305_43.style.backgroundColor = "orange";
        Calmel305_51.style.backgroundColor = "orange";
        Calmel305_57.style.backgroundColor = "orange";
    }  
}
for(i=0; i< lecture_room.CalmelLab1.length; i++){
    if( 35 == lecture_room.CalmelLab1[i]){ 
        CalmelLab1_35.style.backgroundColor = "orange";
        CalmelLab1_41.style.backgroundColor = "orange";
        CalmelLab1_53.style.backgroundColor = "orange";
        CalmelLab1_42.style.backgroundColor = "orange";
        CalmelLab1_54.style.backgroundColor = "orange";
    }  
}
for(i=0; i< lecture_room.CalmelLab2.length; i++){
    if( 35 == lecture_room.CalmelLab2[i]){ 
        CalmelLab2_11.style.backgroundColor = "orange";
        CalmelLab2_12.style.backgroundColor = "orange";
        CalmelLab2_13.style.backgroundColor = "orange";
        CalmelLab2_21.style.backgroundColor = "orange";
        CalmelLab2_22.style.backgroundColor = "orange";
        CalmelLab2_23.style.backgroundColor = "orange";
        CalmelLab2_24.style.backgroundColor = "orange";
        CalmelLab2_35.style.backgroundColor = "orange";
        CalmelLab2_41.style.backgroundColor = "orange";
        CalmelLab2_42.style.backgroundColor = "orange";
        CalmelLab2_43.style.backgroundColor = "orange";
        CalmelLab2_44.style.backgroundColor = "orange";
    }  
}
for(i=0; i< lecture_room.CalmelLab3.length; i++){
    if( 11 == lecture_room.CalmelLab3[i]){ 
        CalmelLab3_11.style.backgroundColor = "orange";
        CalmelLab3_12.style.backgroundColor = "orange";
        CalmelLab3_13.style.backgroundColor = "orange";
        CalmelLab3_21.style.backgroundColor = "orange";
        CalmelLab3_22.style.backgroundColor = "orange";
        CalmelLab3_23.style.backgroundColor = "orange";
        CalmelLab3_35.style.backgroundColor = "orange";
        CalmelLab3_51.style.backgroundColor = "orange";
        CalmelLab3_41.style.backgroundColor = "orange";
        CalmelLab3_42.style.backgroundColor = "orange";
        CalmelLab3_45[0].style.backgroundColor = "orange";
        CalmelLab3_52.style.backgroundColor = "orange";
        CalmelLab3_53.style.backgroundColor = "orange";
    }  
}
for(i=0; i< lecture_room.CalmelLab4.length; i++){
    if( 35 == lecture_room.CalmelLab4[i]){ 
        CalmelLab4_35.style.backgroundColor = "orange";
        CalmelLab4_43.style.backgroundColor = "orange";
        CalmelLab4_44.style.backgroundColor = "orange";
        CalmelLab4_46.style.backgroundColor = "orange";
        CalmelLab4_47.style.backgroundColor = "orange";
    }  
}
for(i=0; i< lecture_room.Moria109.length; i++){
    if( 35 == lecture_room.Moria109[i]){ 
        Moria109_35.style.backgroundColor = "orange";
    }  
}
for(i=0; i< lecture_room.Moria212.length; i++){
    if( 35 == lecture_room.Moria212[i]){ 
        Moria212_35.style.backgroundColor = "orange";
    }  
}

for(i=0; i< lecture_room.Moria301.length; i++){
    if( 35 == lecture_room.Moria301[i]){ 
        Moria301_11.style.backgroundColor = "orange";
        Moria301_12.style.backgroundColor = "orange";
        Moria301_14.style.backgroundColor = "orange";
        Moria301_15.style.backgroundColor = "orange";
        Moria301_21.style.backgroundColor = "orange";
        Moria301_22.style.backgroundColor = "orange";
        Moria301_23.style.backgroundColor = "orange";
        Moria301_24.style.backgroundColor = "orange";
        Moria301_34.style.backgroundColor = "orange";
        Moria301_35.style.backgroundColor = "orange";
        Moria301_36.style.backgroundColor = "orange";
        Moria301_42.style.backgroundColor = "orange";
        Moria301_45[0].style.backgroundColor = "orange";
        Moria301_52.style.backgroundColor = "orange";

    }  
}

for(i=0; i< lecture_room.Moria305.length; i++){
    if( 35 == lecture_room.Moria305[i]){ 
        Moria305_35.style.backgroundColor = "orange";
        Moria305_34.style.backgroundColor = "orange";
    }  
}

for(i=0; i< lecture_room.Moria308.length; i++){
    if( 35 == lecture_room.Moria308[i]){ 
        Moria308_35.style.backgroundColor = "orange";
        Moria308_34.style.backgroundColor = "orange";
    }  
}

for(i=0; i< lecture_room.Moria310.length; i++){
    if( 35 == lecture_room.Moria310[i]){ 
        Moria310_12.style.backgroundColor = "orange";
        Moria310_13.style.backgroundColor = "orange";
        Moria310_14.style.backgroundColor = "orange";
        Moria310_15.style.backgroundColor = "orange";
        Moria310_16.style.backgroundColor = "orange";
        Moria310_31.style.backgroundColor = "orange";
        Moria310_32.style.backgroundColor = "orange";
        Moria310_34.style.backgroundColor = "orange";
        Moria310_35.style.backgroundColor = "orange";
        Moria310_43.style.backgroundColor = "orange";
        Moria310_44.style.backgroundColor = "orange";
        Moria310_55.style.backgroundColor = "orange";
    }  
}
for(i=0; i< lecture_room.Bokkeum301.length; i++){
    if( 35 == lecture_room.Bokkeum301[i]){ 
        Bokkeum301_15.style.backgroundColor = "orange";
        Bokkeum301_45[0].style.backgroundColor = "orange";
        Bokkeum301_13.style.backgroundColor = "orange";
        Bokkeum301_43.style.backgroundColor = "orange";
        Bokkeum301_12.style.backgroundColor = "orange";
        Bokkeum301_42.style.backgroundColor = "orange";
        Bokkeum301_11.style.backgroundColor = "orange";
        Bokkeum301_21.style.backgroundColor = "orange";
        Bokkeum301_31.style.backgroundColor = "orange";
        Bokkeum301_41.style.backgroundColor = "orange";
        Bokkeum301_51.style.backgroundColor = "orange";
        Bokkeum301_31.style.backgroundColor = "orange";
        Bokkeum301_32.style.backgroundColor = "orange";
        Bokkeum301_14.style.backgroundColor = "orange";
        Bokkeum301_44.style.backgroundColor = "orange";
        Bokkeum301_23.style.backgroundColor = "orange";
        Bokkeum301_53.style.backgroundColor = "orange";
        Bokkeum301_24.style.backgroundColor = "orange";
        Bokkeum301_54.style.backgroundColor = "orange";
        Bokkeum301_34.style.backgroundColor = "orange";

        Bokkeum303_14.style.backgroundColor = "orange";
        Bokkeum303_44.style.backgroundColor = "orange";
        Bokkeum303_16.style.backgroundColor = "orange";
        Bokkeum303_46.style.backgroundColor = "orange";
        Bokkeum303_15.style.backgroundColor = "orange";
        Bokkeum303_45[0].style.backgroundColor = "orange";
        Bokkeum303_41.style.backgroundColor = "orange";
        Bokkeum303_42.style.backgroundColor = "orange";
        Bokkeum303_34.style.backgroundColor = "orange";
        Bokkeum303_36.style.backgroundColor = "orange";
        Bokkeum303_37.style.backgroundColor = "orange";
        Bokkeum303_35.style.backgroundColor = "orange";
        Bokkeum303_13.style.backgroundColor = "orange";

        Bokkeum401_22.style.backgroundColor = "orange";
        Bokkeum401_52.style.backgroundColor = "orange";
        Bokkeum401_24.style.backgroundColor = "orange";
        Bokkeum401_54.style.backgroundColor = "orange";
        Bokkeum401_23.style.backgroundColor = "orange";
        Bokkeum401_53.style.backgroundColor = "orange";
        Bokkeum401_11.style.backgroundColor = "orange";
        Bokkeum401_41.style.backgroundColor = "orange";
        Bokkeum401_15.style.backgroundColor = "orange";
        Bokkeum401_45.style.backgroundColor = "orange";
        Bokkeum401_14.style.backgroundColor = "orange";
        Bokkeum401_44.style.backgroundColor = "orange";
        Bokkeum401_31.style.backgroundColor = "orange";
        Bokkeum401_32.style.backgroundColor = "orange";
        Bokkeum401_13.style.backgroundColor = "orange";
        Bokkeum401_43.style.backgroundColor = "orange";
        Bokkeum401_35.style.backgroundColor = "orange";
        Bokkeum401_34.style.backgroundColor = "orange";

        Bokkeum403_35.style.backgroundColor = "orange";
        Bokkeum403_14.style.backgroundColor = "orange";
        Bokkeum403_44.style.backgroundColor = "orange";
        Bokkeum403_34.style.backgroundColor = "orange";
        Bokkeum403_13.style.backgroundColor = "orange";
        Bokkeum403_43.style.backgroundColor = "orange";
        Bokkeum403_15.style.backgroundColor = "orange";
        Bokkeum403_45[0].style.backgroundColor = "orange";

        Bokkeum405_34.style.backgroundColor = "orange";
        Bokkeum405_35.style.backgroundColor = "orange";

        Bokkeum407_41.style.backgroundColor = "orange";
        Bokkeum407_42.style.backgroundColor = "orange";
        Bokkeum407_25.style.backgroundColor = "orange";
        Bokkeum407_26.style.backgroundColor = "orange";
        Bokkeum407_11.style.backgroundColor = "orange";
        Bokkeum407_21.style.backgroundColor = "orange";
        Bokkeum407_31.style.backgroundColor = "orange";

        Bokkeum409_35.style.backgroundColor = "orange";

        Bokkeum407_26.style.backgroundColor = "orange";
        Bokkeum407_11.style.backgroundColor = "orange";
    }  
}
for(i=0; i< lecture_room.IllipBasicSNLab1.length; i++){
    if( 35 == lecture_room.IllipBasicSNLab1[i]){ 
        IllipBasicSNLab1_35.style.backgroundColor = "orange";
        IllipBasicSNLab1_44.style.backgroundColor = "orange";
        IllipBasicSNLab1_42.style.backgroundColor = "orange";

        IllipBasicSNLab2_42.style.backgroundColor = "orange";

        IllipEduLab_47.style.backgroundColor = "orange";
        IllipEduLab_21.style.backgroundColor = "orange";
        IllipEduLab_41.style.backgroundColor = "orange";
        IllipEduLab_14.style.backgroundColor = "orange";
        IllipEduLab_22.style.backgroundColor = "orange";
        IllipEduLab_15.style.backgroundColor = "orange";
        IllipEduLab_24.style.backgroundColor = "orange";
        IllipEduLab_13.style.backgroundColor = "orange";
        IllipEduLab_44.style.backgroundColor = "orange";
        IllipEduLab_11.style.backgroundColor = "orange";
        IllipEduLab_12.style.backgroundColor = "orange";
        IllipEduLab_35.style.backgroundColor = "orange";
        IllipEduLab_34.style.backgroundColor = "orange";

        IllipBehavAnalysisLab_26.style.backgroundColor = "orange";
        IllipBehavAnalysisLab_13.style.backgroundColor = "orange";
        IllipBehavAnalysisLab_14.style.backgroundColor = "orange";
        IllipBehavAnalysisLab_11.style.backgroundColor = "orange";
        IllipBehavAnalysisLab_36.style.backgroundColor = "orange";
        IllipBehavAnalysisLab_35.style.backgroundColor = "orange";
        IllipBehavAnalysisLab_52.style.backgroundColor = "orange";
        IllipBehavAnalysisLab_53.style.backgroundColor = "orange";

        Illip405_12.style.backgroundColor = "orange";
        Illip405_32.style.backgroundColor = "orange";
        Illip405_13.style.backgroundColor = "orange";
        Illip405_43.style.backgroundColor = "orange";
        Illip405_51.style.backgroundColor = "orange";
        Illip405_52.style.backgroundColor = "orange";

        Illip501_35.style.backgroundColor = "orange";
        Illip501_37.style.backgroundColor = "orange";
        Illip501_38.style.backgroundColor = "orange";
        Illip501_15.style.backgroundColor = "orange";
        Illip501_45.style.backgroundColor = "orange";
        Illip501_14.style.backgroundColor = "orange";
        Illip501_44.style.backgroundColor = "orange";
        Illip501_16.style.backgroundColor = "orange";
        Illip501_46.style.backgroundColor = "orange";
        Illip501_11.style.backgroundColor = "orange";
        Illip501_12.style.backgroundColor = "orange";
        Illip501_13.style.backgroundColor = "orange";
        Illip501_43.style.backgroundColor = "orange";
        Illip501_41.style.backgroundColor = "orange";
        Illip501_42.style.backgroundColor = "orange";
        Illip501_52.style.backgroundColor = "orange";
        Illip501_54.style.backgroundColor = "orange";
        Illip501_34.style.backgroundColor = "orange";

        Illip503_22.style.backgroundColor = "orange";
        Illip503_24.style.backgroundColor = "orange";
        Illip503_25.style.backgroundColor = "orange";
        Illip503_52.style.backgroundColor = "orange";
        Illip503_13.style.backgroundColor = "orange";
        Illip503_43.style.backgroundColor = "orange";
        Illip503_14.style.backgroundColor = "orange";
        Illip503_44.style.backgroundColor = "orange";
        Illip503_36.style.backgroundColor = "orange";
        Illip503_37.style.backgroundColor = "orange";
        Illip503_45[0].style.backgroundColor = "orange";
        Illip503_46.style.backgroundColor = "orange";
        Illip503_56.style.backgroundColor = "orange";
        Illip503_35.style.backgroundColor = "orange";
        Illip503_11.style.backgroundColor = "orange";
        Illip503_41.style.backgroundColor = "orange";
        Illip503_12.style.backgroundColor = "orange";
        Illip503_42.style.backgroundColor = "orange";
        Illip503_34.style.backgroundColor = "orange";

        Illip505_55.style.backgroundColor = "orange";
        Illip505_13.style.backgroundColor = "orange";
        Illip505_36.style.backgroundColor = "orange";
        Illip505_42.style.backgroundColor = "orange";
        Illip505_35.style.backgroundColor = "orange";
        Illip505_52.style.backgroundColor = "orange";
        Illip505_46.style.backgroundColor = "orange";
        Illip505_56.style.backgroundColor = "orange";
        Illip505_22.style.backgroundColor = "orange";
        Illip505_12.style.backgroundColor = "orange";
        Illip505_14.style.backgroundColor = "orange";
        Illip505_16.style.backgroundColor = "orange";
        Illip505_34.style.backgroundColor = "orange";

        Illip507_36.style.backgroundColor = "orange";
        Illip507_11.style.backgroundColor = "orange";
        Illip507_41.style.backgroundColor = "orange";
        Illip507_23.style.backgroundColor = "orange";
        Illip507_44.style.backgroundColor = "orange";
        Illip507_43.style.backgroundColor = "orange";
        Illip507_52.style.backgroundColor = "orange";
        Illip507_56.style.backgroundColor = "orange";
        Illip507_35.style.backgroundColor = "orange";
        Illip507_22.style.backgroundColor = "orange";
        Illip507_31.style.backgroundColor = "orange";
        Illip507_32.style.backgroundColor = "orange";
        Illip507_43.style.backgroundColor = "orange";
        Illip507_34.style.backgroundColor = "orange";

        Illip509_52.style.backgroundColor = "orange";
        Illip509_53.style.backgroundColor = "orange";
        Illip509_16.style.backgroundColor = "orange";
        Illip509_46.style.backgroundColor = "orange";
        Illip509_12.style.backgroundColor = "orange";
        Illip509_45[0].style.backgroundColor = "orange";
        Illip509_32.style.backgroundColor = "orange";
        Illip509_41.style.backgroundColor = "orange";
        Illip509_35.style.backgroundColor = "orange";
        Illip509_13.style.backgroundColor = "orange";
        Illip509_42.style.backgroundColor = "orange";
        Illip509_34.style.backgroundColor = "orange";

        MiralChall_25.style.backgroundColor = "orange";
        MiralChall_35.style.backgroundColor = "orange";
        MiralChall_12.style.backgroundColor = "orange";
        MiralChall_42.style.backgroundColor = "orange";
        MiralChall_31.style.backgroundColor = "orange";
        MiralChall_32.style.backgroundColor = "orange";
        MiralChall_13.style.backgroundColor = "orange";
        MiralChall_43.style.backgroundColor = "orange";
        MiralChall_22.style.backgroundColor = "orange";
        MiralChall_52.style.backgroundColor = "orange";
        MiralChall_34.style.backgroundColor = "orange";
        MiralChall_14.style.backgroundColor = "orange";
        MiralChall_44.style.backgroundColor = "orange";

        MiralLogos_35.style.backgroundColor = "orange";
    }  
}
}
